{
  "Hello" : "Are you there?",
  "courses" : {
    "ENGL 251B" : "Introduction to British Literature II",
    "CS 241" : "Foundations of Sequential Programs"
  },
  "notes" : {
    "ENGL 251B" : {
      "course_content_by_units" : {
        "2 What is Literature?": {
          "null": [
            "What makes something a piece of literature, or what is the nature of being literary? No one knows for sure.",
            "What makes something a piece of literature, while another piece isn’t? All we know is that literature is all complicated in a specific way. So who decides what is literature? Literary scholars, critics and reviewers, and the market all play their role.",
            "Literary arguments concern what works are part of a certain tradition. “The Call of the Wild” by Jack London was part of English Literary Studies in the USSR because of its societal criticism, but wasn’t to be found in American syllabi. Many great disputes of who is and isn’t literary have occurred around John Milton and John Donne. Milton was considered universally praiseworthy until he was attacked by T.S. Elliot. He championed Donne and his conversational style.",
            "_The Canon Wars_ concern the push for including women, black, and immigrant authors in literature syllabi. This launched a slew of protests around American Universities on both parties in the issue around the mid-nineties. When ACTA was asked to look into whether or not dropping the Shakespeare requirement was indeed a trend, they could twenty-three out of seventy of the universities studied still required Shakespeare. Some consider this appalling, since they consider Shakespeare essential to the English Literary Tradition. Bruce Smith, English Professor at Georgetown, says that the “Major Authors” requirement, including Shakespeare, prevented room in the curriculum for women and minority authors. Upon release the requirement, Georgetown was subject to student protests and lots of media coverage, primarily from right-wing organizations and student groups. The media coverage given to the issue may function out of a public desire to return to the old value system. All this reveals that our definition of literature, and essential literature, is far from universally accepted, and even further from being unchanging.",
            "The word “literature” itself has had a storied history. It’s meant:",
            "1. Familiarity or learnedness with classical texts (~1450 - )",
            "2. Writing or producing a book/word (~1660 -)",
            "3. A body of literary works made in a certain region/period (1711 -), or a work of lasting merit (1850 -)",
            "4. A body of works on a certain subject (~1790 -)",
            "5. Leaflets, pamphlets to promote products or inform (~1850 -)",
            "This is important, because it points out how “literature” has always been changing. It’s about where we get the third meaning of literature that a new market arises for novels, and heck, that novels even became a thing! Before this novel-market, literature needed patronage to be funded and produced. People looked for a place of imagination and fantasy to escape the increasingly cold, rational world they inhabited. So people not only sought good books, but books that were good in a very particular way — hence, where we get literature today.",
            "So why study literature? Because literary works are human achievements of wit and creativity, and studying literature gives us insight into the intricacies of writing and the effective use of words.",
            "The _Russian Formalists_ asserted that literary criticism must be highly structured and systemic, and that literary studies shouldn’t focus on *literature*, but *literariness*: what makes something literary. This was the beginning of modern literary criticism. Tools for the toolbox:",
            "_Literary Theory_: A way of thinking systematically and explicitly about what literature is and the methods we use in analyzing and criticizing it. Modern literary theory has typically been stimulated by importing ideas from other disciplines into the study of literature."
          ]
        },
        "3 Russian Formalism": {
          "null": [
            "Recall that the Formalists put the emphasis of literary criticism on _literariness_. Why did this idea only originate with the Russians? In the times of the Formalists, there were giant political pressures that would eventually lead to two revolutions — the first deposing its absolute monarchy, the second installing Communism. So, plenty of people, including artists, called for revolutionary change, and published manifestos. The most popular of these was “A Slap in the Face of Public Taste”, by the Futurists. They expressed discontent with the status quo of poetry and endeavoured to make new poetry out of new words. This was avant-garde art, which intentionally aimed to disrupt the status quo and change people’s world views. This shift even empowered painters to think of paintings less as representations of the world, but more as representations of the power of their own medium.",
            "The Futurists issues a pamphlet called, “The Word as Such”, which called for people to “explore the world” beyond its ordinary meaning. It’s in this context that Victor Shklyovsky made his greatest essays — he shared the Futurists’ zeal for revolution. He shared his own manifesto, “The Resurrection of the Word”, at a Futurist hangout cafe.",
            "In it, Shklyovsky talked much about how language and individual words lost its metaphorical or descriptive quality. If we are to sense the form of words, we have to slow our perception of words — to understand how words mean. He said, “The fate of the works of old artists... is exactly the same as the fate of the word itself. They are completing the journey from poetry to prose.” So, no longer a way to understand language, but to receive meaning.",
            "So, literariness isn’t a property that certain texts have forever, but rather is an effect that they can impose upon us to reconsider what the language we’re receiving even means.",
            "Although it isn’t really worthwhile to study the Futurists’ work, it’s certainly interesting to study an English approximation to their efforts: e e cummings.",
            "In, “anyone lived in a pretty how town,” e e cummings deliberately manipulates language to make us pay attention, to force us to make out the story. For instance, he puts ‘anyone’ in the place of where a person’s name would usually go, to indicate the subject of this poem being an average, ordinary person. He often imitates a child’s speech. He also uses ‘autumn winter spring summer’ as a way of saying, ‘year in and year out’.",
            "What makes Cummings interesting: he uses the grammar and vocabulary of children, and introduces it as a new, avant-garde approach to poetry. This new literary technique isn’t Cummings’ invention, it’s a repurposing of a type of language that’s always been there.",
            "Shklyovsky’s manifesto lead him to meet other students, specifically linguistics students. This lead him to believe that literature was just a special use of language, and to borrow concepts from other fields. Later, in ‘Art as Technique’, he expands upon the ideas of his manifesto and creates a new theoretical concept: defamiliarization: the making of something strange and difficult from something that had before been too easy. Unlike others, he seeks to apply this to both poetry and prose.",
            "How do we defamiliarize events and stories? Shklyovsky advocated strongly for a visible narrator who used new manners of description to depict familiar things, but we can also accomplish a similar effect by changing the order of events, or by making some events not understood by the audience until the end of the story, and perhaps never!",
            "From the malleability of event structure, the Formalists created the terms plot for the prose events as they are presented to the reader, and story for prose events as they occurred chronologically. Motivation is the justification for artistically distorting the events in such a way that the reader would perceive them as natural.",
            "So, the literariness of a work isn’t in its message, or how it communicates this message, but the degree to which it defamiliarizes. Other critics would disagree with Shklyovsky on this point. But we all agree that this should be a part of art. In this way, the content of a work means less than its techniques employed.",
            "So! Altogether, literary theory focusses on literariness, which has value because it forces us to sense the form of words. The method of literary criticism is the evaluation of techniques. So, now we have new tools for the toolbox:",
            "Defamiliarization: what the Formalists believed literature accomplished — it should make familiar things strange to us.",
            "Technique: the means by which literature defamiliarizes the world.",
            "Motivation: the justification the text provides for the use of a technique.",
            "Story: the series of events as they might be in real life.",
            "Plot: how the events of the plot are deformed in the text.",
            "Poetic language: how poetry uses language in such a way that distinguishes itself from ordinary speech."
          ]
        },
        "4 The Sign & the Sign-System": {
          "null": [
            "Paul de Man claims that literary theory go underway when we started to use linguistic terminology when talking about literature, especially synchronic linguistics, as opposed to historic linguistics. The basic unity to this theory is the sign and the sign-system.",
            "Why the fuss about linguistics? Because it had a big impact on the work of literary critics, and in general, this shift hugely impacts not only how we think of literature and language, but all species of study. This formed Structuralism, which clerkly dominated literary theory ever since — and it all came from one guy: Ferdinand de Saussure.",
            "Saussure was moved to thing of the philosophy of linguistics, because he was so dissatisfied with current terminology in philology, the linguistics of his days. He was convinced that words were composed of something more than just sounds — since words of a language weren’t just sounds, they were meaningful sounds, and no current Philologist had a solid understanding of where the meaning came from. Saussure was convinced that this meaning could only come from sounds in a language system.",
            "So, what counts in a language isn’t just sounds, but contrasts and organizations of sounds. Humans can make a large variety of sounds, but not all will count as meaningful in a given language. We should note that within speakers of the same language, there are many differences in pronunciation — in effect, the same “word” could be composed of entirely different sounds. What matters, then, isn't sound, but contrasts of sounds. As Saussure said, “in language, there are only differences.”",
            "When we acquire language, we learn that system of contrast, not the historical background of words. So, the system is synchronic. Also note that this means that, as meaning is generated from ‘differences’ of sound, so too are meanings composed of contrasts of smaller meanings. Just as every language organizes sounds in its own way, every language organizes meanings in its own way. Think of how English lacks the plural/formal second personal pronoun, which other European languages how (i.e. vous in French). To make up for it, we’ve invented “y’all” in slang! Which is quite funny, because “you” originally was the plural second-person pronoun! So all in all, the basic unit of meaning is defined in relation to other sounds, and that meaning is shifting all the time.",
            "Saussure saw his Philology as so insufficient that he himself made terminologies for what he saw as the fundamental units of language. A sign was the union of the sound-pattern and the meaning — a meaningful unit of language. He called the sound-pattern the Signifier, and the meaning/concept the Signified. By this, he hoped to expand this system beyond language, but to all things which, in some way, contain meaning.",
            "Then the meaning of signs is forged through convention — green means go because we’ve all said it means go. So the language system is ‘social’ and is held together by nothing but our collective agreement. Yes, they change continually, but no one person can make them change.",
            "This system in is the background — what we actually encounter is sentences, which string together meanings that make sense together. He called the actual sentences of speech Parole and the language system itself Langue. He called these strings of signs Syntagmata, or Syntagm singular. Syntagmata don’t have to be sentences: “dogs” is a syntagm, since it strings together “dog” and “s” to pluralize.",
            "Associative Relations are the relations between a particular sign and the other signs we can compare it to. Like how “anti-drugs” relates to “anti-Communist” and “anti-immigration” tells us that “anti-“ means “against”. This is part of how language changes.",
            "Sometimes the sound drifts and not the meaning. Example: “undecem”, the Latin word for eleven (derived from “un” meaning “one”, and “decem” meaning “ten”), drifted to “onze” in French for the same concept. This shifted the term from being relatively arbitrary to completely arbitrary. Sometimes we fit foreign words to suit syntagms that we’re familiar with. This demonstrates that the history doesn’t matter, and it’s only the system that determines the meaning. This broadened to become the field of Structuralism. Tools:",
            "Sign — Signifier/Signified: the units of a system are signs. A sign is defined its place in the system. It is made up of two parts: a signifier and the signified. A signifier can be a written pattern, a combination of graphic symbols, or a sound pattern. The signified is the meaning that is bound to the pattern.",
            "Synchronic - Diachronic: the language system is synchronic, it exists at a moment in time: it is meant to represent what we know when we use language, and in this respect it is different from the history of a language, its diachronic aspect, which is interesting, but irrelevant.",
            "Syntagmatic - Paradigmatic (Associative): When we encounter language it takes the form of syntagmata, liner strings of signs like sentences. The elements of the syntagm are defined as associative relations, which we will call paradigmatic relations."
          ]
        },
        "5 Structuralist Analysis I": {
          "null": [
            "Let’s turn to the study of folklore in Russia. Towards the 20th century, this study became more intense and focussed mostly on historical analyses of folktales — but Vladmir Propp was having none of it. In “The Morphology of the Folktale”, he analyzed hundreds of folktales to argue that they were all telling, more or less, the same story.",
            "He argued that each action in the narrative could be embodied in several different ways. So though the structure of the story remained constant, its particular implementation varied. He called the fundamental units of this structure functions: “the act of a character, defined from the point of view of its significance for the course of the action.”",
            "Thus, the character’s actions didn’t have inherent meaning, but had meaning because of its role in the system of narrative. This also means that stories are composed of functions, not characters. It was only when Claude Levi-Strauss and Roland Barthes noticed the similarity between Propp and Saussure that we finally got Structuralist Analysis. Woo!",
            "Barthes argues that narrative events/characters have meaning by virtue of their place in a system.",
            "A function is an event with consequences for the progress of the narrative. The most high-consequence ones among these are cardinal functions, whereas those that don’t have an impact on the narrative, usually left there for realism, are catalyzers. We call strings of functions sequences.",
            "Not everything is a function, though. There are also indices which relate to a higher level in the text (e.g. telling us more about a character or an event). These are categorized into true indices which tell us things of consequence, and informants which are of no real consequence.",
            "Yet it would be a mistake to think that all stories are just long sequences. Barthes argued that functions are integrated into Actions — large-scale stuff like quest, or struggle. These Actions are played out by actants. Above this is the layer of narration. Tools:",
            "Actions: these are the large-scale events that define the narrative as a whole. Actions are typically characterized in abstract, large-scale terms: struggle, quest, and so on.",
            "Actants: the agents necessary to an action. For example, a quest must have a subject, and a quester who quests for the subject. A struggle must involve two actants in a struggle. So actants are defined in relation to a particular action. An Actant isn’t necessarily only a single character, and a character may have two actantial roles.",
            "Function: events that lead to something else in the narrative, or follow up on something before it. Functions usually pose a risk of some kind.",
            "Cardinal Functions: functions essential to the narrative",
            "Catalyzers: small-scale events that fill in the space between cardinal functions, but are not essential for the progress of the narrative",
            "Indices: references upwards to a character or place — they attribute qualities to what will be an actant or properties to a scene or landscape. These qualities and properties will be important to the shape of the narrative.",
            "Informants: like indices, but ultimately incidental descriptions",
            "Sequence: the arrangement of functions from beginning to end. May embody a certain action altogether."
          ]
        },
        "6 Structuralist Analysis II": {
          "null": [
            "When Saussure build his theory, he aimed to scientifically explain why and how language worked — not to evaluate one language as better than another. He made it a descriptive, not evaluative field.",
            "So, when Structuralism took off, it couldn’t tell you whether one narrative was better than another. Strictly speaking. It can certainly tell you how a narrative works, though.",
            "Think of the narratives in “A Scandal in Bohemia”. We have Watson tell the tale of a disguised Holmes getting injured, going into the house, then Watson throwing a smoke bomb. Holmes re-narrates the events later to clarify that he had gotten injured so as to fool Adler into revealing the location of the photograph. Finally, we have Adler re-narrate all these events again from her letter, where she reveals that she out- deveined Holmes by perceiving his ruse. Each new narrative makes “Scandal” interesting as it unfolds — the narrative meaning of all the events are revealed as time goes on.",
            "So, Structuralism doesn’t necessarily have “Plot and Story” — new influences on Structuralism such as Genette introduced “Narrative and History”. Totally different, of course. But for now we’ll keep using “Plot and Story” in the Formalist sense.",
            "A plot has three dimensions:",
            "1. Order",
            "2. Duration",
            "3. Frequency",
            "Order",
            "Genette called ordering differences between the plot and story “anachronisms”.",
            "* Retrospective anachronisms are when events are described after their occurrence in the story. Ex. the King describing his affairs with Adler to gain Holmes’ services (and, thus, far after the affairs actually occurred).",
            "* Anticipatory anachronisms occur when events are described before their occurrence in the story. These are rarer, but might occur in past-tense narrated stories where the narrator may interject with insight gleamed after the narrative concluded.",
            "Genette adds another dichotomy to anachronisms in regard to whether or not they’re “inside” the story:",
            "* External anachronisms are descriptions of events that take place outside the occurrence of the story. For example, the King’s description of his affairs with Adler would be an external anachronism, because those events occur outside “A Scandal in Bohemia”",
            "* Internal anachronisms are out-of-order descriptions of events that take place within the occurrence of the story. For example, Adler’s letter to Sherlock.",
            "Within internal anachronisms, Genette adds a final dichotomy:",
            "* Complete anachronisms describe events that were not known in the plot before. For example, Holmes’ description of his day to Watson.",
            "* Repetitive anachronisms describe events that were known before, or will be known later, perhaps to add detail or ship perspective. For example, Adler’s account in her letter to Holmes.",
            "Genette calls retrospective internal repetitive anachronisms “Recall”, and anticipatory internal completive repetitive anachronisms “Announcement”. Thing can get more complicated, of course. You can have Announcements within retrospective external anachronisms, for instance.",
            "Duration",
            "Recall that the plot distorts the story. One way it can do this is in various representations of time, by how different events are described.",
            "* Scene: the time of plot patches time of story. For example, Watson’s narration of the episode at Adler’s house.",
            "* Summary: time of plot is shorter than time of story. For example, the King’s retelling of his affairs with Adler.",
            "* Stasis: the plot continues onwards, though nothing is currently happening in the story. Time is “paused”. A moment is elaborated upon. Ex. Watson describing the King’s appearance. Note: this isn’t necessarily all “description” sections in story — only the times where story time is “paused”.",
            "* Ellipsis: time is “skipped” in the plot. Ex. the archetypical “Two weeks later...”, or when Watson and Holmes depart, the it’s cut to when they meet at the flat the next day.",
            "Frequency",
            "Genette distinguished types of narration by frequency:",
            "* Singulative narration: events described only once.",
            "* Repetitive narration: events described many times.",
            "* Iterative narration: an event in the plot related to many occasions of events in the story. Ex. “Every Friday, I’d got out for a beer with Paul.”",
            "Genette made a big deal over iterative narration. He was aware that an author could sneakily claim that something would be iterative, but in fact make it singulative by providing the detail of a singulative episode. Ex. “Every Friday, I’d go out for a beer with Paul and he’d tell me all about his girlfriend and how he was getting along with his classes. Most often, he’d pleasantly describe...”",
            "Genette also noted how an iterative narration could be limited (ex “Every Friday that October...) or specified (ex “Every Friday at 5PM sharp...).",
            "Let’s note: Genette created these concepts because he really wanted to analyze what made a particular novel interesting. But we can use these concepts to understand what makes detective stories possible. Tools for the toolbox listed above."
          ]
        },
        "7 Deconstructive Criticism": {
          "null": [
            "Saussure created synchronic linguistics in Switzerland, which Barthes picked up in Egypt, and combined into this wild soup of ideas in Paris. That’s where Jacques Derrida picks it up. He was an immigrant from a French colony, and had trained to be a philosopher. He created Deconstructionism in the 1960’s as a kind of confrontation between Structuralism and philosophy. He critiqued both classes of ideas.",
            "Derrida believed that philosophy had to swallow how Structuralism described the language that allowed for reasoning and argumentation. Philosophy often focussed on removing ambiguity in ideas — if aimed for a perfectly ‘practical’ language which perfectly expressed truth and reasoning.",
            "Structuralism came at thing from a totally different view, but it still had places where Saussure was inconsistent — Derrida thought Saussure’s conceptions were foreclosed upon in his writings to prevent the realization of their radical implications. Derrida coins the term “Differance” to express how the ‘meaning in difference’ was always deferred to further differences to find its real meaning.",
            "Derrida said that we usually assume Differance ends when we reach a sign that isn’t a reference to another sign — this he called ‘the transcendental sign’.",
            "Yet Saussure never said anything of this sort. In the beginning of his text, he goes on a tirade against writing as an artificial representation of spoken word. Writing, he said, has usurped the spoken word in the world of academics — and that mistakes have been made because of it.",
            "The end result is that the signifier alters the signified — what he calls ‘the monstrosities’! He demotes the dignified under the signified here — yet that contradicts what he says later, about how they are equal!",
            "Derrida’s response to this is interesting. He suggests that, despite Saussure’s tirade against writing as a monstrosity, writing itself was a language — one that deconstructs the heritage it was based upon.",
            "Derrida went on to practice Deconstructionism in philosophy, politics, and history, against those who thought of writing as a monstrosity or an intrusion. He thought that these texts were quite revealing. He also thought that in order to change meaning, you had to impress yourself into the pressure points of a language.",
            "That’s why Derrida called it “Deconstructionism”; these changes of language, and rearrangements of texts — an author would make new avenues, the close them off before they got too dangerous. Derrida claimed to find what the text really seemed to say, then express this as ‘the logic of the supplement.’",
            "He began analyses in finding instabilities, inconsistencies, or ‘metaphysical opposition’ in the texts. Either this or an ‘undecidable’.",
            "Readers were sometimes not only baffled by what Derrida argued, but how he argued it. His claim of philosophy and structuralism, the consequences were that you didn’t only choose your signifiers. The signified is always already in the position of the signifier! The links between signifiers were of the utmost importance. Remember how Shklyovsky argued how all words were tropes? Derrida’s thoughts run along the same lines. So his work seemed to claim that to criticize something you had to work in the text’s links of signifiers.",
            "Derrida also seemed to believe that analyzing texts as a “structure” or series of structures was like reducing the text to an abandoned city. So, he believed that he did not make the structure into an image by his new analytic technique, but rather “resurrected” the text.",
            "Some complain that Derrida unjustly makes all texts in this manner literature. This is somewhat fair. Derrida himself claimed that literature is where we find Differance dealt with most explicitly, so it’s the most intense. What does it mean to deconstruct literature? To find, expose, and undermine these oppositions or the undecideable.",
            "Deconstruction takes time and patience — all the relationships in a text are pretty... intense. New tools for the toolbox:",
            "Deconstruction: criticism that seeks to exploit and expose the instabilities of a certain text and its repressed radical implications.",
            "Metaphysical Opposition: a systemic contrast of two terms in a text, which the text depends upon or is organized around. One of these terms is dominant, and the other will be something extra or excessive which would disturb the text.",
            "Undecideables: unstable terms within a text, in which the text’s tensions are concentrated. Contain irreconcilable meanings.",
            "Differance: the instability of language, because all signifiers acquire meaning by virtue of their difference from others, which means their meaning is endlessly deferred; the movement from signifier to signifier never stops."
          ]
        },
        "8 Writing and Political Commitment": {
          "null": [
            "Writing and politics have been mixed together since their conceptions. Lysistrata famously brought commentary on gender roles and the Peloponnesian Was onto the Greek stage. The works of Shakespeare, too, have obsessively recorded the goings-on of court life which “deconsecrated” the English monarchy in effect. As the English Civil War climbed in the beheading of Charles I, the great poets of the time, including John Milton, saw it fit to celebrate Republicanism in their works, whether explicitly or implicitly. This continued into the Romanticists and Victorians.",
            "Yet in the middle of the Victorian Period, Matthew Arnold wrote the pamphlet “Culture and Anarchy” as a response to mass protests to extend suffrage. This climaxed in the protests at Hyde Park in 1867, where the government refused to fire at protestors. Arnold saw this as a big problem — because it seemed like mobs could now get away with doing whatever they wanted without any “authority, to counteract the tendency to anarchy.” So, he argued, the new source of authority in British society should be culture, which inherently unites people, and seeks human perfection.",
            "So Arnold argued that the point of literature was to seek an inward human perfection, and not to be caught up with the affairs of the external world — i.e. politics. This lead to consciously anti-political criticism in Britain for the next century or so. However, there eventually came a class of writers and critics who argued for social justice as a part of human perfection.",
            "Another big challenge to anti-political criticism came from the Marxists. After the Bolshevik Revolution, it wasn’t a question of whether writing should be political, but rather how best to make writing political through the clever use of realism. Georg Lukacs famously argued in favour of realism in depicting the evils of capitalist systems. This body of thought ended up being called “modernism”, but what was then called “Formalism”.",
            "The Marxist challenge to anti-political criticism was going by the avant-garde movement as well -- who thought that art entailed revolution in their society. This doesn’t make them all left, by the way, since some in Italy advocated for fascism. Clement Greenberg was among the most influential avant-garde thinkers in America. His German equivalent was Theodor Adorno. They both advocated for art which was decidedly unpopular, and hardly understood by the public.",
            "Adorno claimed there were two types of politically valuable art:",
            "1. art that valued “committed” writing",
            "2. “autonomous” art which employed avant-garde techniques",
            "WWII basically destroyed avant-garde movements in Europe, but new movements took its place in the 50s and 60s. Roland Barthes, for instance, used structuralism and experimental writing to develop a new kind of social criticism — “mythologies” of popular culture, which he used as a vehicle to criticize ideology.",
            "Ideology seeks to produce consent, willing obedience to the existing order. Structuralists believed, like the language system, there existed systems of meaning on top of the language system. This would be the domain of ideology. This is why avant-garde writing is important — it draws close attention to this ideological system.",
            "The 1960s contained a series of political shakeups — the violent decolonialization of Algiers and many African nations, and the civil rights movements in the US. In addition, a new wave of feminism and the gay rights movement.",
            "These shifts in society lead to shifts in academics. Feminists and civil rights advocates critically examined literary studies programs. Feminists drew upon many branches of structuralism, deconstructionism, and psychoanalysis to build their own theoretical structures. Marxists too restructured their own literary theory.",
            "Indeed, it was now seen as a requirement of Left writing to force the viewer to question the sign-system of a particular work. Eventually, though, it would widen its scope to find the radicalization of other literary works.",
            "This had the lasting consequence of eliminating the authorial intent from being the decisive factor in deciding the meaning of a work."
          ]
        },
        "9 Marxist Literary Theory": {
          "null": [
            "We know that literary theory advanced from outside influences. The first of these influences we’ll cover is Marxism. We’ll introduce Marxism, then see how it’ll apply.",
            "The central ideas behind Marxism are simple. One of the tenants is called “The Social Production of the Existence”: the idea that humans are distinctive from other animals, because not only do they build structures and gather food, but they also produce “means of production” that make shelter-building and food-gathering easier for the next generation. Because of this, our environment is more human-made than the environments of our ancestors. However, humans haven’t necessarily shared the means of production, but have collected it among an elite minority of themselves. This is called “property”.",
            "Different societies thought of property differently. Nomadic cultures posited ownership of some animals. More stationary cultures often allowed grazing on ‘common land’. With agriculture, people started owning land, but this land wasn’t distributed evenly. Some owned land, and others worked for land- owners. In some societies, they worked as slaves or indicted servants. With the invention of industrialization, property begun include money, tools, and factory buildings. Property allows control over these means of production.",
            "Social classes arise from these divisions of the means of production. These relations are called “the relations of production”. In Feudal societies, mean were tied up with politics. In capitalist societies, some own the means, and others don’t. Those who don’t must sell their labour to those who do. Those with the means are called “the bourgeoisie”, and those who work for them, “the working class”. Those outside this arrangement, i.e. teachers, lawyers... are called “the middle class”.",
            "So humans can create more than they consume — a surplus. The bourgeoisie keep the surplus, and the working class generally create more than what they’re paid for. That’s why Marx claims class relations are exploitative, and antagonistic. Marx claims that to end this exploitation, we need to throw out the system altogether.",
            "So Marx claimed that just like the bourgeoisie overthrew Feudalism in the French Revolution, we would eventually have another revolution where the working class overthrew capitalism. Why hasn’t the happened? The capitalist class often has government access. But also, ideology! Marx claimed that our social life is closely connected to our thinking, and the class antagonism is closely connected to our social life. Then, capitalists will try to justify to the working class, and themselves, the existence of exploitive capitalism. This manifests itself in laws, religion, metaphysics, and political rhetoric. This is the medium in which people participate in class conflict, as opposed to addressing it directly. So the capitalists’ ideology aims to produce consent from the working class.",
            "The Italian Marxist Antonio Gramsci described this in another useful way: hegemony. To achieve hegemony is to ensure that your ideas direct society — to make your structure apply to all dialogue. So why the bourgeoisie took Europe, they enforced forms helpful to them, and discarded antagonistic forms.",
            "So what’s Marxism to do with literary theory? Well, it posits that literature is entwined with ideology. But what’s the nature of this relation? The simplest answer: they are either a dominant, or subversive ideological form. Yet, remember Lukacs? He advocated for realism as a means of showing class struggles as they really were. Bad literature was that which only showed the surface, bug too literature showed what as underneath. Brecht agreed on “good and bad” but he believed that good theatre instilled critical attitudes in the audience, and made ideology visible.",
            "Terry Eagleton arrived on the scene in the 1960s, after Structuralism and Formalism. He points out that the functions of Structuralism and the defamiliarization of Formalism all had their role to play in ideology. He claimed that form involved three different circumstances:",
            "1. Literary history",
            "2. Ideological circumstances",
            "3. Audience-author relations",
            "Lukacs loved Balzac’s ability to depict Paris social life in a realist, ideological manner. He claimed that realism showed that underneath the seeming atomicity of society, there was this undercurrent of forces and conflict that tied everything together. Without revealing this undercurrent, artistic works are of the dominant ideological structure.",
            "On the opposite end of the spectrum, Pierre Macherey posited that language, which mediates our access to the world, is used in literature in a distinctive manner. Yet, the everyday language disguises ideology. So literature deals with ideological objects. Yet, it isn’t that ideology is false or illusory. What makes ideology is its form. It attempts to show the world as consistent, when it actually isn’t at all — it moves from one image of life to another, without demonstrating their relations of contradiction. So fiction has the chance to clearly thwart ideology — it can be made to seem inconsistent.",
            "In Jules Verne, Macherey analyzes the bourgeoisie ideal of progress — but what happens is in fact a rediscovery of the past. So the adventurer’s journey is an illusion.",
            "So, should we analyze particular works at all in Marxist analysis? Some say we should analyze genres that have remained dominant for long periods. Let’s analyze “Scandal in bohemia” as one entry in the detective genre, then.",
            "The ideological object here is the belief in the overwhelming power of empirical observation and deduction. Think of Holmes’ “extraordinary powers of deduction”, which he insists is really just working off the same information as everybody else — this is echoed in the story’s structure. In this respect, “Red- Headed League” is probably a better illustration.",
            "Oh! It should be noted that these stories are written when English Society is becoming increasingly difficult to understand. Think of the anonymous faces of the immigrant packed 18th-19th century London. The stories tend to oscillate between two goals: to provide clue that could to the reader arriving at the solution, and to portray Holmes as particularly skilled.",
            "To illustrate the ideology, the stories sometimes include the odd character who draws the wrong conclusion. Think of Javez Wilson in “League”. So Doyle limits the power of observation, then. Tools for the toolbox:",
            "Ideology: the medium in which we become conscious of conflicts within class societies. Ideology covers the whole range of ideas — political, artistic, religious, philosophical. We have ideology whenever an idea functions to disguise the real conflicts of society, or seeks to generate consent to an unfair society.",
            "Hegemony: the process by which one class gains the consent of the populace to their worldview. It is the process of building consent out of the existing ideologies, it assumes that to direct a society you have to tilt or angle people’s beliefs."
          ]
        },
        "10 Psychoanalytic Criticism": {
          "null": [
            "Sigmund Freud was interested in literature — he often attempted to apply psychoanalysis to literature. We’re going to study a later branch of psychoanalysis which incorporated Structuralism under Lacan.",
            "Psychoanalysis is both an elaborate theory and method. Freud developed this theory from his experiences with treating individual patients. Among the most famous of this theoretical discoveries is his discovery of the unconscious — his decision to think of the mind not as a single conscious entity, but a conscious and unconscious.",
            "The content of the unconscious is utterly different from the thoughts of the conscious. Its content is there only because it had to be “buried”. Freud thought of this when treating patients suffering from “neurosis” and “hysteria”. He believed that hysterics “suffer from reminisces” — where at some point in their lives they experienced a strong impulse or wish which had to be buried because of societal standards.",
            "Freud came up with different techniques to interpreting these symptoms — usually by placing the patient in a place where their repressive nature is weakened.",
            "Freud radically assured the the Baby had no sense of self — its just a bundle of impulses, a “person- omlette”. He believed that the impulses of an infant’s life are “erotic”, since adult erotic pleasures are derivative of these infantile sensations. Many of these pleasures are directly in association with the mother — so when the father becomes a rival for the child’s affections, the child develops an Oedipal complex. To become a man, the child must give up this complex, and begin forging its own complex. Though necessary, this transition is traumatic, as it forces the developing human to repress these erotic wishes. These repressed wishes constitute the unconscious. Thus, adulthood and adult sexuality is predicated upon the existence of an unconscious.",
            "All this is kinda far-fetched, right? But keep in mind that Freud was describing more a pattern of development than a process that literally applies to everyone. At some point, the child will encounter prohibition of impulses that forces a child to give up their narcissism and triggers a reorganization of the world.",
            "In the 50s and 60s, Jacques Lacan introduced psychoanalysis and structuralism to one another. He suggested that the moment of consciousness is also the moment a child acquires language.",
            "Note that in order for an Oedipal complex to develop, the child must accept that it is one and not the other — that it is like the father, but that it is separate from the father. So, it has to abstract itself as a class of humans. This requires language.",
            "Lacan said this is “the entry into the symbolic order.”",
            "Remember that Derrida said that meaning slips from signifier to signifier. Lacan said so too it was for satisfaction and language. The symbolic order is always pushed around by our wants — this is called “the Real”, which disturbs and upsets the symbolic order’s desire to be complete.",
            "So Lacan claims that “The Real” is something we only encounter in indirect forms — in the patterns of life, and in our dreams. Readings:",
            "(reading.) Zizek contests the common notion that psychoanalysis is dead from exposure to better scientific methodology and a modern culture of hedonism. He accounts that psychoanalysis in the realm of dreams is useful to think in the principle of “reality is for those who cannot sustain the dream.”",
            "So Fantasy is where we protect ourselves from the knowledge that the symbolic order is disrupted and incomplete. It’s the way we “sew the world up”. European Anti-semitism is one such Fantasy. This explains the strange attachment we have for certain ideas.",
            "(reading.) Brooks argued that, in essence, the only reason why we give beginnings in a story their unique significance is because they indicate an ending of some kind: so, we hastily finish the beginning and work through the obstacle of the middle so we may know the satisfaction of the ending. Yet this desire for death is moderated by the innate fear of the improper ending — hence, repetition intermediates the drive for death, linking a novel’s subplot to its ‘main plot’, linking various aspects of a story to various points of the plot — thus mimicking how a dreamer will repeat stimuli of everyday life or traumatic events in order to master the food of stimuli. Yet, we shouldn’t be so foolish to think the sole purpose of repetition is mastery: rather, it permits the emergence of mastery and the “possibility of postponement”. The energy of repetition, with all its ‘deviance, extravagance, excess’ is what ‘maintains the plot in its movement through the vacillating play in the middle’.",
            "So then does repetition subvert the very notion of beginning and end? We know that beginnings (in the traditional sense of “it all began when...”) must happen after ends, and that “it is the role of fictional plots to impose an end which yet suggests a return... a rereading... [it wants] to recapture us in its doomed energies.” Fictional works ultimately strive to eternally re-instigate and fulfill the death instinct.",
            "So, psychoanalysis is interested in the desires of and within the text, and how they are related. One application was created by Julia Kristeva in poetry. She thought structuralism had the weakness of thinking that the language’s speakers in this theory had to possess an unconscious. Her claim was that the child was able to reproduce noises that were associated with meaning before acquisition of language. The sounds were made for pleasures — they were themselves agents. Isn’t this the point of Dr. Seuss? This babbling is something we must discard as a pre-language, a separate economy language. Literature’s object, however, isn't identifiable outside of language. This is a usage of the semiotic.",
            "Peter Brooks explored what psychoanalysis means in narrative. He thinks of his work as neo-structuralist. Every narrative is set in motion by a desire. While detours and delays in the fulfillment of the narrative’s desire appear accidental, they must exist for a proper fulfillment: “we want it to end... but we want it to go on.” Readers meaning, a point, from their narrative.",
            "In “A Scandal in Bohemia”, there are two layers of desire: the resolution of the ambiguous beginning of the episodic mystery, and the resolution of the strange and bizarre into something normal and understandable. On top of these two layers there’s a third: what is meant by ‘To Holmes, she is always the woman”. Tools for the toolbox:",
            "Unconscious: that which disturbs our conscious life, but is its precondition.",
            "The Symbolic Order: the order produced at the resolution of the Oedipal Complex",
            "The Real: that which resists the symbolic order",
            "Fantasy: the way we attempt to repair to symbolic order",
            "Semiotic: the signification that precedes the Symbolic",
            "Desire: the form our impulses take on in the symbolic order. It is by definition unsatisfiable."
          ]
        },
        "11 Literature and Gender": {
          "null": [
            "Feminism wasn’t a sudden movement — it has historical roots in many cultures and periods of times. Feminism has moved to get women writers included in the Canon.",
            "Mary Wollstonecraft wrote “A Vindication of the Rights of Women”, as a reaction to the French Revolution — a movement she supported — primarily addressing the rights of men, not women. Yet she failed to convince her English counterparts, and was publicly ridiculed.",
            "So Feminism got its start in the 19th century — in the US, during the Seneca Falls Convention. In Canada, the suffrage movement began in the 1890s and continued through the next two decades. It was most militant in England, where the movement tried not only for suffrage but also education rights and birth control.",
            "All this impacted literary criticism: Virginia Woolf became a famous critic who focussed on women writers, and elevated writers like Austen and Bronte for writing “as women write, not as men write”. This idea, that women literature had a different style than men, served to be very influential for the future of feminism in literary criticism.",
            "Second-wave feminism came about in the 60s amidst many other political movements. This lead to a broader scope of ideas from which to draw from. This also lead to many branches of feminist thought. We might classify these strands of thought into four groups:",
            "1. Equality Feminism: aimed the change laws to bring about equality",
            "2. Radical Feminism: wanting to emphasize difference between men and women, and change in women’s organization",
            "3. Socialist Feminism: emphasis of women in the workplace",
            "4. Deconstructive Feminism: deconstructing boundaries between male and female",
            "Feminists invented new political tactics and formats of demonstration. Discussion groups. “The personal is political” was a motto which indicated that politics echoed in personal actions.",
            "Going forward, we’ll classify feminist literary criticism as follows:",
            "1. Critiques of sexism in literature",
            "2. Advocacy for women's criticisms",
            "3. Theory of “ecriture feminine”",
            "4. Feminist psychoanalytic theory",
            "5. American poststructuralist feminism",
            "So (1) critiques of sexism was basically like shooting fish in a barrel, but the scope was so big. Many scholars took offence to this project, but eventually became more nuanced.",
            "Similar resistance was met upon (2) the project of “gynocentrism” and women authors in the Canon. This eventually resulted in reexaminations of genres.",
            "(3) Ecriture Feminine held that the division between he and she was held up by the symbolic order — which could only be brought down by “womanly writing” which asserted its femininity by its style.",
            "(4) Michell Foulcault extended Derrida to show how our relationship to our body was moderated by social institutions. Judith Butler extended this idea to suggest that gender was performative: gender was a consolidation of our actions and significants. So this meant that there were no natural combinations of gender and sexuality.",
            "Let’s apply all this to “Scandal”. The easiest criticism of it is that its the story of how Holmes was beaten by a woman’s wit. Keep in mind that this was published in the middle of suffrage movements, and the emergence of “The New Woman”.",
            "But there’s more here than a celebration of a woman’s wit. After all, she’s “the woman” — the only woman in the story. She’s what captures “the male gaze” here. We receive descriptions of of her from Holmes, the King, and Watson, but never through her own gaze. Also keep in mind that she’s the greatest representation of her gender in Holmes’ mind, but she’s described as having a man’s wit.",
            "So Doyle’s story is ultimately ambiguous. Her wit is part of her male allure. What if a non-straight male, or straight woman, reads the wok? This is a problem of spectatorship. Tools for the toolbox:",
            "Gender: the term we use to describe the relationship between masculinity and femininity",
            "Écriture Féminine: the kind of writing, described by Hélène Cixous, that undermines the binary oppositions of gender. A subversive and playful kind of writing, an almost artistic version of deconstruction, which is supposed to express one’s bodily sensations more fully than “male” writing",
            "Gynocentrism: a critical stance that emphasizes the recovery and revaluing of literary works by women",
            "Performative Concept of Gender: the argument that gender is not something natural but something which is always a performance, an act"
          ]
        },
        "12 Literature, The Nation, and Colonialism": {
          "null": [
            "We’ll finish the course through Postcolonial theory and criticism. Unlike our focus on Marxism, Psychoanalysis, or Feminist criticism, this body isn’t theoretically unified set of ideas, but rather an interest in a particular situation — a concern of how colonialism influences literature. This contains many theories.",
            "In 1914, the British and French Empires were still going pretty strong. By then, it was a world of some independent nations, and many colonized countries.",
            "Many empires predate Britain: Rome engulfed the Mediterranean, and the Arabic Empire took up North Africa and the Arabian peninsula. This “habit” arose out of sophisticated societies requiring cheaper access to resources. But the colonialism we’re concerned with is modern colonialism.",
            "Colonizing countries, though, didn’t describe their actions in such blunt economic forms. They described it as a noble attempt to civilize primitive people in need of European, or Christian, guidance. So Europeans thought themselves superior.",
            "Yet “civilizing” people required acquiring knowledge about them. They described native peoples, their communities, and their religions and beliefs. This had a dramatic impact on European arts and sciences. Linguistics had part of its origins when a man noticed Sanskrit’s similarity to Greek and Latin. It was also the origin of anthropology, and the theory of race. This reminds us that the colonial “knowledge” wasn’t entirely factual: it was grounded in a particular inarguable ideology. Said describes this apparatus as Orientalism: the ideology which justified colonialism and masked its true horrors.",
            "There were many different kinds of colonies. Settler colonies involved placing European communities on previously Native land. This often involved the displacement or destruction of native communities. In Africa, however, colonizers sought to control colonies without displacement (exception in South Africa). A local elite was often educated and converted, and after were tasked with impressing colonial power upon their community. This created a division within the local population.",
            "There was resistance against colonialism from the beginning. Native peoples in Canada and the US fought against colonizers, though were defeated. Latin states had revolutions against their colonial masters. And India had a series of revolts before Gandhi.",
            "The long process of decolonization in the late 20th century is what justifies the term “Postcolonial”, which describes nations with a colonial past. Populations may still be divided in elites and the majority. This creates a difference in literary output — in language use, for instance. Writers who use native languages remain virtually unknown. This also gave many European writers experiences in colonial processes. Finally, mass immigration has scattered many peoples across the globe (via slavery or otherwise). Thus, multiculturalism is a consequence of colonialism.",
            "Postcolonial studies suggest the terms “core” and “peripheral” countries, to describe military and economic power unevenly distributed across nations.",
            "Postcolonial studies often concern the literature of colonizing nations (so as to see how colonialism impacted their own understanding of the world), expanding the canon of English literature to writers in postcolonial nations, and attempts to understand colonial ideologies within literary texts. So postcolonialism and its theories is similar to feminism — vast, diverse, and decentralized.",
            "Edward Said was the first to insist upon the importance of colonialism in “Orientalism”. So he urges us to see the impacts of colonialism and imperialism, even in texts that seem unrelated to the subject at first glance.",
            "This work is historical — it broadens texts to include the colonials and imperialism of the time. These twin force he claims, were entangled in what it meant to be British at the time. This resulted in twin theoretical innovations:",
            "1. Double Consciousness",
            "2. Hybridity",
            "Double Consciousness was coined by W.E.B. Du Bois as a “sense of always looking at one’s self through the eyes of others”. He was referring to the plight of black Americans who were forced to see themselves through the lens of white society. This was taken up by Postcolonialist thinkers.",
            "So it’s easy to see the application to literature. Postcolonial authors may have a very difficult task. Authors of colonist origin may not wish to discuss colonialist ideology whatsoever.",
            "Writing often describes a scene or a place. Postcolonial criticism urges us to examine what’s included and excluded from this picture. Who is seen as human, or as alien? Who belongs, and who is out of place?",
            "As part of the apparatus of colonialist thought, the colonizers had to draw a sharp line between themselves and the colonized population. Yet we know that these sharp oppositions (i.e. primitiveness vs civility, rationality vs mysticism) are not as they seem: that one side defines the other. So it may seem that the British people are a group with particular characteristics (as they define themselves, at least), closer examination reveals that these characteristics are merely a collection of qualities opposite to what defined (in their minds) the Colonized Others. So Britishness is dependent upon colonialism.",
            "A psychoanalytic twist: Bhabha suggested that the colonial subject was something like Freud’s Conscious, and its colonized other, its Unconscious. The colonizer is often caught between disgust of the colonized, and a fascination of them. Bhabha sees this as a fragility of the colonizer’s identity being fundamentally different from the colonized — as a kind of anxiety concerning how entangled they are from the colonized. This heightened for colonial administrators and the colonized administrators that they were often tasked to educate in language and culture, yet still had to somehow differentiate themselves. Hybridity refers to all such ambiguities between colonizers and colonized.",
            "Stuart Hall gave hybridity a different spin. His interest was how nationalities described themselves as pure (i.e. “The Americans”). This was often entangled in race. So races and nations often wanted to disavow the fact of mixture.",
            "So whats the application to literature? An application to Postcolonial literature. It has succeeded in expanding the Canon. Yet it also asserts the presence of colonialism in every ext even it its not explicit. Tools for the toolbox:",
            "Postcolonial: the situation former colonies and colonizing countries find themselves in after colonies achieve independence.",
            "Double Consciousness: the dilemma of the black subject in America, and the colonial subject, who sees themselves through the lens of their oppressors.",
            "Hybridity: the fate of all attempts to define a national or ethnic identity as self-sufficient. All identities are mixed.",
            "Symptom: indirect, coded expressions of some conflict in the text, something it’s trying to repress."
          ]
        }
      },
      "course_name" : "ENGL 251B",
      "is_online" : "True",
      "taken" : "Spring Term 2017, 3B"
    },
    "CS 241" : {
      "course_content_by_units" : {
        "Introduction" : {
          "09-07-2016": [
            "h2. Course Info",
            "* Website: student.cs.uwaterloo.ca/~cs241",
            "** read EVERYTHING!!!! Esp. syllabus",
            "* 10 assignments, 2 weeks now until assignment. After that, 1week/assignment. ",
            "** Get ahead! You don't need 2 weeks to do assignment 1.",
            "** Each assignment has 9 subparts.",
            "** Due Thursday at 7PM.",
            "* DL Troy's lecture slides.",
            "* No annotated versions of these slides available. Consider printing them out and writing them out. ",
            "* Marmoset is a small monkey. It looks at your program and it says, 'no!' Two types of tests: public tests and release tests. No secret tests.",
            "* Almost no marking for style.",
            "* Even if you've used up all release tokens, all tests will still be run on test. ",
            "* Don't use marmoset like a compiler, or a testing program. Don't anger the monkey.",
            "* Your program will be run on the linux.student.cs environment. Use linux tools like vim. ",
            "* Marking: Assignments 25 / Midterm 25 / final 50. Assignments 2.5% each. Must pass weighted exam average to pass.",
            "* Office hours are listed on course page. Attend them!",
            "* Excessive Collaboration! Don't do it!",
            "** do your own work! Make sure you could say, 'yeah, I did this myself' to your mom.",
            "** don't give your work to others",
            "** do not write down anthing when discussing",
            "* No textbooks for this course. Optional texts in DC library. Other reference materials in course site that you should read beforehand.",
            "* Don't post first -- search and read first!",
            "",
            "h2. Purpose of the Course",
            "* You should learn about how you learn in this course.",
            "* We'll be talking alot about language in this course. Tons of meta-language, and meta-cognition.",
            "* This is your first 'Computer Science' course, really. It's the most important you'll ever take. It teaches you programming, really.",
            "* Computer Science is the science of abstraction. It's what we turn to when we want to generalize, to encapsulate.",
            "* This is how you'll learn what the compiler actually does -- this will remove the mystery behind compilers and running files.",
            "",
            "h2. Model of Computation for CS241",
            "In this course, a computer is exactly a CPU and RAM. The CPU controls and manipulates data. RAM loads and stores data, and is connected bidirectionally to the RAM.",
            "This model is all we need to concern ourselves with: everything else is just tangential. We aren't going to worry about the physical details of either component: in this course, we can trust both components in the abstract.",
            "h2. The Semantics of Data",
            "Binary data is a sequence of bits. That's all it is! Everything constructed off data is built off /interpreting/ binary data. So, for instance, '10100011' could mean tons of thins: a decimal number, a hexa number, a character. This is the semantics of computer language: how we decide between the varying meanings of a portion of data. One interpretation is a machine language: a squence of bits with one meaning, tied to machine architecture (e.g. Intel/Motarola, 32-bit/64-bit). Great for machines! They only know one meaning behind every bit: on or off. Machine lanuage is terrible for humans. Try Assignment 1 and find out!",
            "h2. Assembly Language enters Stage Left",
            "* Since Machine Code is so terrible, Assembly language is a simple, textual representation of machine language.",
            "* Far more human readable. This is how you'll do A2.",
            "* Relatively easy to translate assembly language to machine language.",
            "** And that's abstraction for you! Assembly is an abstraction of Machine -- they're equivalents, but assembly hides the details for you in order for you to see the big picture.",
            "* So it's relatively easy to take something from assembly to machine -- that's what an 'assembler' is called. The Assembler is a program, which takes in a program and outputs a program.",
            "* How hard is it to write an assembler? Take a shot at A3 and A4. A1, you are an assembler, A2 makes you make write assembly, then A3 and A4 makes you automate this stuff."
          ]
        },
        "The Semantics of Data" : {
          "09-07-2016": [
            "h2. Bits!",
            "* A bit is a 1 or 0. Shortened from BInary digiTS",
            "* This works because of electricity, in all of its diverse voltages, is categorized into 'on' and 'off' by ranges.",
            "* A bit means that you have one of two sequences: '0' or '1'. Again, the semantics of either of these sequences are up to the client.",
            "** Similarly, 2 bits means one of four sequences. Altogether, n bits means that you can represent any of 2^n sequences. That is, 2^n different things!",
            "* Let's take the 3-bit example: we have the possibility of representing 8 different things. There are at least two interpretations of these sequences as integers: signed and unsigned. Unsigned: add up all the digits. Signed: subtract the greatest digit from the remaining sum of digits.",
            "** That is, we can represent the same bits as the [0,7] or [-4,3]. For n bits: [0, 2^n - 1] or [-2^n-1,2^n-1 - 1]",
            "** I mean, you could do other interpretations and mappings, but that's unconventional.",
            "** Really, the only way we have these interpreations is because they're physically and electronically convenient.",
            "* The two's compliment operation looks like this:",
            "# Write the absolute value in unsigned binary",
            "# If the original value is positive, done! Else,",
            "# Negate the bits (i.e. swap all 1s with 0s and vice versa) and add one.",
            "* So what's '1010'? Could be unsigned or signed. If unsigned, it's 10. If signed, it's -6 (found via 2's complement operation).",
            "h2. Characters!",
            "* Characters are always 8 bits, for which there are always 3 meanings:",
            "# Unsigned binary number",
            "# 2's complement binary number",
            "# an ASCII character",
            "h2. Hexadecimal",
            "* Why do we have this? Because binary sucks! It's so innefficient! So hexadecimal, which has 16 digits, is far more comgressed.",
            "* Hexadeci has dgitis 0-9, followed by A-F.",
            "* There's nothing special about deci -- we only have it because we've got 10 fingers.",
            "* How to convert between hexadeci and binary?",
            "** Instance: 1010111110011000. Take the number into 4-bit chunks, each of which represent one of 16 possibilities. So that becomes AF98"
          ],
          "09-13-2016": [
            "h2. Grouping of bits",
            "* The most common grouping of bits is a byte. Contains 2^8 = 256 possibilities.",
            "** Want to estimate powers of to? Remember that 2^6 = 64, and 2^10 = 1024.",
            "** Remember this. If you don't, Troy won't give you your degree -_-",
            "* For integers, a byte can contains 0... 255 or -128... 127 if unsigned or 2's comp respectively",
            "* For characters, we can get letters, numbers, punctuation, symbols, ... altogether, the sum of all these necessary characters is less than 128, or 2^7. So that fits nicely in a byte.",
            "h2. Larger Groupings of Bits",
            "* ASCII: American Standard Code for Information Interchange. Represents everything that was listed above, which has a representation within [0, 127]. At first, represented order. Capitals and lowers are separated by a change in the second (or third, rather, since the first is always 0)  most significant bit.",
            "* Extended ASCII: used the most significant bit as well, representing ASCII characters in addition to characters used in other languages. Sadly, these have two standards. 'And when you have two standards, you have no standards.' Especially since it's the whole of representation between 128... 255. But no matter the standard, it can't represent larger scopes of asian languages, which is why we have...",
            "* Unicode! This is backwards compatable with ASCII, so if it sees a 0 is the MSB, it treats it as ASCII. If it begins as 1, it treats the first byte of the character as information about the alphabet the character is in, followed by 3-5 bytes for the character in the alphabet.",
            "* You'll only need to encode ASCII characters for this code.",
            "h2. A Word about Words",
            "* A Word, on a machine, is",
            "# the size of one instruction",
            "# the size of one unit of memory, usually",
            "# also the maximum address in RAM",
            "* In the 50s and 60s, machines used 8-bit words. That is, instructions were 8-bits long. Which meant 256 bytes of memory. HAd to be careful with how you used it!",
            "* In the 70s and 80s, you get 16-bit machines. 2^16 = 64k, roughly = 64 kB of RAM.",
            "* In the mid 80s - 2000s, we get the 32-bit machines, 2^32 = (2^10)^3 * 2^2 = 4 billion = 4 GB",
            "** This is also the size of MIPS",
            "** You need more than 4GB to just start Windows in the first place nowadays",
            "** Windows 95 was super psyched about being 32-bit",
            "* Pretty much every machine from now on will be 64-bit. 2^64 = (2^10)^6 * 2^4 = 1.84 x 10^19. This is more RAM than you will ever need. You don't need this much, unless you're Google.",
            "* For this course, a machine is 32-bit.",
            "h2. Files",
            "* A file is merely a sequence of bites, nothing more and nothing less.",
            "* Files themselves don't have any meaning, but rather by using them in certain ways (ex. cat, g++, xdd).",
            "** cat will try to display the contents of the file as though it were ASCII characters.",
            "** xxd displays the 'actual bits' in the file in hex.",
            "** eog displays images correctly. Try cat'ing an image file -- you'll get a ton of nonsense.",
            "** if you pipe through the nonsense from cat'ing an image into less (xxd blah.jpg | less), you can gleam the ASCII from the image file. Camera info and date will always be encoded in the metadata of it."
          ]
        },
        "The Machine Cycle & MIPS" : {
          "09-13-2016": [
            "h2. Our Machine: A Stored Program Computer",
            "* CPU flows back and forth to the RAM via the 'bus'/'Backbone'",
            "* What's inside the CPU?",
            "** Some registers ($0, $1, ... $31), each of which can hold a word (i.e. 32 bits)",
            "** The brains of the CPU is in the Control Unit, which has access to Registers and ALU",
            "** The Arithmetic Logic Unit does all operations, which has access to lo and hi registers",
            "** The Program Counter register and Instruction Register also both have 32 bits.",
            "* RAM is the same thing repeated again and again...",
            "** It's boxes with labels, all boxes being the same size (guess what size? 1 word. 32 bits).",
            "** Each box is composed of bytes -- in our system, 4.",
            "** Generally, the RAM has about the same amount of boxes as 2^word_size / number_of_bytes_in_word",
            "h2. Machine Langauge & MIPS as a Programming Language",
            "* All instructions on MIPS reference will, at some point, be encountered.",
            "* MIPS is the language that our CPU speaks. It's Turing-complete (it can do all the operations anyhting else can do).",
            "* 'add $1, $2, $3' has the human meaning 'add together the values in $2 and $3 and place this sum into $1', and has the machine meaning '0000 0000 0100 0011 0000 1000 0010 0000', or '0x00430820'",
            "* To use the results of multiply, you've got to access the hi and lo registers. ",
            "** Hi represents the most significant 32 bits of the results of multiplication, and lo represents the least significant 32 bits",
            "** With division, low gets the quotient, hi gets the remainder.",
            "** You can directly move the contents of hi or lo into a register with hfhi/hflo",
            "h2. Communication between CPU and RAM",
            "* How do you use RAM, though? With load and store. Store puts it into the RAM, load gets it out of the RAM.",
            "* In the lw $t, i($s) instruction, the contents of $s is treated as a hexadecimal address into RAM. The contents of $t will be stored with MEM[$s + i]",
            "h2. Machine Cycle",
            "* PC means 'program counter' -- it's what holds the adress of the next instruction to execute. Keyword: NEXT. NOT THE ONE CURRENTLY BEING EXECUTED.",
            "* IR holds the current instruction.",
            "** Your program is in RAM at address 0. Or, at least, the first MIPS of it.",
            "** When the program stars, the PC is set to 0, and the IR is set to the current instruction -- i.e. the instruction stored at address 0.",
            "** While executing the first instruction, the PC has been changed to 4 but the IR remains the same until the next instruction is executed.",
            "** So, all changes in the IR will happen pretty much simultaneously with changes in the IR.",
            "* Notic that you're writing subprograms, and that your programs should always return -- that is, return to the OS. That is, jr $31. or jump the PC to the value of $31, thus changing the next thing to execute to whatever's in $31"
          ],
          "09-15-2016": [
            "h2. Machine Cycle (cont.)",
            "* Remember the Fetch-Decode-Execute Loop?",
            "** IR always contains the instruction of the current instruction",
            "** PC always contains the pointer to the location of the /next/ instruction to execute",
            "* So why use Jump Register (i.e. jr)? Becase we need to set the PC to where it needs to go after our subprogram is done.",
            "h2. Assembly Language",
            "* MIPS has 18 different instructions.",
            "* Each of 32 registers contains 32 bits",
            "* mips.twoints reads two integer values, and initializes $1 and $2, and executes everything within an emulator.",
            "** Why an emulator? Because if you use the real thing, you could mess stuff up real bad.",
            "h2. Special Registers",
            "* $0 is always 0, and cannot be changed by overwritting by any means.",
            "* $31 is initially set to be the return address: the location in RAM to continue execution.",
            "h2. Assembly Language",
            "* almost 1-to-1 correspondence with machine language. There's only one binary representation of any machine language, but not necessarilly the other way around.",
            "* cs241.binasm converts assembly into machine, but only available after a1 is due.",
            "* Abstraction really means that you keep the stuff you need and polish away all the nitty gritty details. That's assembly.",
            "h2. Examples 1,2,4",
            "* .word is only meant to be in reference to a number, and should never, ever be directly executed. So, for now, we'll probably only use it in combination with lis.",
            "* Generally, instead of using if statements, we'll be using slt and beq in clever ways",
            "* Since we can also use this to loop over stuff, we know that MIPS is Turing complete -- that is, this language can do the same elementary stuff as Java, C++, Perl, etc.",
            "* Let's talk documentation should look like, kiddos. In MIPS, the (;) indicates the start of a comment. Check ex4asm.pdf for well-styled code.",
            "* Your code has variables, if only $0, ..., $31. That's a big difference between this and other languages: there's no option for variable names in the code",
            "** For A2, your programs may well be 100 lines long. You may be using 6-7 registers for different things. Without documentation, you will perish under the weight of your own incompetence and slef-ignorance.",
            "** Stick to a singular meaning for every register.",
            "** Use whitespace.",
            "* To access arays, use the mips.array command. These are stored in RAM, starting at the address stored in $1.",
            "h2. Memory Revisited",
            "* mips.array modifies the CPU such that $2 gets the size of the array, and $1 of the address where the array starts.",
            "* How do we do dynamic mem allocation? That's for the end of the term.",
            "h2. Example 5 - Output!",
            "* If you store something at 0xffff000c, it'll tell stdout to print out what's put there as an ASCII character",
            "* Can also read from standard input, located at 0xffff0004. Same as output, only one character at a time",
            "h2. Lecture 4! Loop Example",
            "* Set variables always at the top",
            "* To fix broken set less than's (with bad i's), you can just use labels. You use labels like:",
            "'loop: add $3, $1, $2",
            "...",
            "bne $2, $0, loop'",
            "* And it all works out! Labels can also be on their own line -- it'll always refer to the next word after it, no matter the whitespace",
            "* Multiple labels an also refer to the same instruction/address",
            "h2. Storing and Restoring Registers",
            "* We aught to make it look like the registers have the same value at the beginning and end",
            "* This doesn't mean that we can't change register values, just the we should put it back the way we got them.",
            "* To store the original values of registers, we can save them on the stack.",
            "** That's what $30 is for: it's the stack pointer.",
            "h2. Procedures: Example 6A and 6B",
            "* $30 always refers to the top of the stack",
            "* By convention, $1 and $2 are your arguments, and $3 is your return value",
            "* Notice the first 2 instructions of Example 6A is a couple store words.",
            "** You'll always store them at the top of the stack, then decrement $30 to adjust accordingly",
            "** pushing uses sw"
          ],
          "09-20-2016": [
            "h2. Example 6B",
            "* Recall that reg 30 has already been stored with the location of the stack",
            "** When you use the stack, decrement $30 by 4 to represent the new top of the stack",
            "* For this reason, $1 and $2 are stored at the top of the stack.",
            "** At the end of the program, these are retrieved.",
            "** Note that before the old $1 and $2 values are loaded back from RAM, $30 is decremented by 8",
            "* $3 isn't stored/loaded back because it contains the return value.",
            "* Notice that the content of Example 6B (sumOneToN) is called within the body of Example 6A",
            "** This is in the form of .word sumOneToN -- the label is used as an address!",
            "* jr 31 in 6B will jump back to the code in 6A.",
            "* Crucial to this process is `jalr $1` in 6A. jalr $1 means that pc will be set to the contents of $1, and $31 will be set to the old PC value. Essentially, it ties $31 to a certain place in the program: to the instruction after jalr $31 instruction: where the old PC would've pointed to.",
            "h2. Rules for stack usage",
            "* So let's say you store n words onto the stack. Afterwards, you `sub $30, $30, 4n` (or the actual MIPS equivalent of that) to properly decrement the stack pointer.",
            "* So then you do your thang, then immediately after you will `add $30, $30, 4n` to properly increment $30 to where it should be again, and load everything back from address.",
            "* In general, if you push it onto the stack, you'll need to pop it back at by the end of your subprogram.",
            "h2. Recursion in MIPS",
            "* Recursion is composed of:",
            "# Base Case(s): produce the value of the smallest problem size",
            "# Recursive Case(s): compute the 'current' value based on smaller problem sizes; call the method again in a way to reduce the problem size",
            "* So, to do recursion, follow these steps:",
            "# Blindly believe that your method will give you the correct answer in the design of the Recursive Case. DON'T LOOK AHEAD. Believe in your future base case.",
            "# Make a plan, and document it. It's worth your while to write down some pseudocode before writing out your (probably long) MIPS subprogram",
            "h2. Example 7A: 'The Main Program'",
            "* the example ode is cut into segments for saving, the program body, restoring, and returning.",
            "* The body just calls recSum, essentially",
            "* 7B is where it gets interesting.",
            "* recSum begins by saving registers on the stack, and decrementing the stack head.",
            "* Recall that summing the numbers of 1 to n can be accomplished by summing n and the sum of 1 to (n-1).",
            "* If n is 0, the subprogram just jumps to the jr $31.",
            "* If n is greater than 0, we have to adjust $1 to have the proper n value for the next call -- that being, n-1. to do that, we'll decrement $1 by 1 and load $2 into $1",
            "h2. A trace of the flow of control",
            "* So, 7A first stores $31 and $4 into RAM",
            "* Then we jump to your first recSum with $1 == 3. Let's shorten that to rS(3).",
            "* rS(3) stores $1, $2, $4, $31, and calls rS(2) since $1 != 0",
            "* rS(2) stores $1, $2, $4, $31, and calls rS(1) since $1 != 0",
            "* rS(1) stores $1, $2, $4, $31, and calls rS(0) since $1 != 0",
            "* rs(0) stores ..., then realizes $1 == 0, so it jumps straight to the jr 31",
            "* rs(0)'s jr 31 jumps back to the instruction after the jalr in rs(1)",
            "* rs(1) calls jr 31, then jumps back to the instruction after the jalr in rS(2)",
            "* rs(2) calls jr 31, then jumps back to the instruction after the jalr in rS(3)",
            "* rs(3) calls jr 31, then jumps back to the instruction after the jalr in Example 7A",
            "* Example 7A jumps back to the OS.",
            "* Every time a recursive call returns, the things it put on the top of the stack are pop Example 7A",
            "* Example 7A jumps back to the OS.",
            "* Every time a recursive call returns, the things it put on the top of the stack are pop Example 7A",
            "* Example 7A jumps back to the OS.",
            "* Every time a recursive call returns, the things it put on the top of the stack are popped.",
            "h2. Template for MIPS recursion",
            "# Save registers",
            "# Check base case",
            "# Look for how to find the next value",
            "# Restore and return registers",
            "h2. Binary trees in (linear) RAM",
            "* For the purposes of a2p8, assume you have the root in a[0], the left in a[1], and the right in a[2]. And that's one tree node.",
            "** The tree isn't empty, so there's at least one node in it.",
            "* You can compute the length of a list using linear recursion. Sure, easy enough But with a binary tree, you'll have to recurse in a binar manner",
            "** You'll need to jalr to the left check, jalr to the right child, then combine the results. In between the two jalr's, save the result of your first jalr -- not just in $3 exclusively!",
            "h2. Other MIPS notes",
            "* There are often unsigned alternatives to typically signed operations. Use at your own discretion.",
            "* There aren't any local variables in MIPS: only registers and stacks. You pick where you want to store info.",
            "* Chill out on dynamic memory for another 8 weeks. You don't need it right now. "
          ]
        },
        "Assemblers" : {
          "09-20-2016" : [
            "h2. Overview",
            "* Any assembler takes in a sequence of characters, and outputs a sequence of bits.",
            "* That is, you make an assembly language program in ASCII, put it through an assembler, then out pops a machine language program.",
            "* In A1, you're the assembler. On A2, cs241.binasm is the assembler. In A3/A4, you write the assembler. The good news is: by that point, you already have binasm to give you the right answer.",
            "h2. Stages to an assembler",
            "* Inside the giant abstract box of the assembler, the ASCII goes through PAss 1, which creates an intermediate representation. Pass 2 takes in the intermediate epresentation of pass 1, as well as the symbol table it produces, and finally produces the machine language program",
            "h2. Why two passes?",
            "* First, we need to deal with labels. Like, `beq $1, $3, sadness` needs to have sadness translated into the equivalent number.",
            "** Since MIPS can have both forwards and backwards references, we need at least more than one pass",
            "** This is what the symbol table contains: where al the labels are.",
            "h2. Defining assembly language",
            "* informal description: see website",
            "* a formal description of the MIPS language, using regex and semantic definitions, will be done A5 and after. This is math.",
            "h2. Basic assembly language syntax and semantics",
            "* syntax: form or structure. Does this instruction follow the right structure?",
            "* semantics: meaning. To have meaning requires syntax. What does this accomplish?",
            "* syntax, for the assembler, we have to be concerned with whether the input has the correct form. Similarly, we have to make sure that the machine language syntax is correct. This is far easier to do.",
            "* semantics, for the assembler, refer to 'what should this instruction do?' To answer this question, you need to concern yourself with your current location, and where you might want to be.",
            "* a label referes to a spot I might want to be.",
            "h2. Analysis (First Pass)",
            "* We must generate an intermediate representation and symbol table.",
            "* tokenization is the process by which I take input (a sequence of characters), and I output a sequence of tokens.",
            "** For example, a, d, d, , $, 3 -> 'add' <- reference to the MIPS add instruction",
            "* A tokenizer might take in 'add $1, $1, $2', and output an <ADD> token, <REG>, <COMMA>, <REG>, <COMMA>, <REG>.",
            "* We're given a tokenizer for A3. Thanks, Troy!"
          ]
        }
      },
      "course_name" : "CS 241",
      "is_online" : "False",
      "taken" : "Fall Term 2016, 3A",
      "instructor" : "Troy Vasiga"
    }
  }
}
